In [3]:
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import GridSearchCV

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('ggplot')
%matplotlib notebook

In [5]:
#loading data

train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')

In [7]:
# saving the PasserengerId for final

passengerId=test.PassengerId

In [8]:
# merge train and test

titanic=train.append(test,ignore_index=True)

# creating index

# doubt1

train_idx=len(train)
test_idx=len(titanic)-len(test)

In [16]:
print(train_idx)
print(test_idx)

891
891

In [17]:
titanic.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [18]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [20]:
#To check if any column has null
print(titanic.isnull().sum())
#To get those columns:
print(titanic[titanic.isnull().T.any().T])

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64
       Age Cabin Embarked      Fare  \
0     22.0   NaN        S    7.2500
2     26.0   NaN        S    7.9250
4     35.0   NaN        S    8.0500
5      NaN   NaN        Q    8.4583
7      2.0   NaN        S   21.0750
8     27.0   NaN        S   11.1333
9     14.0   NaN        C   30.0708
12    20.0   NaN        S    8.0500
13    39.0   NaN        S   31.2750
14    14.0   NaN        S    7.8542
15    55.0   NaN        S   16.0000
16     2.0   NaN        Q   29.1250
17     NaN   NaN        S   13.0000
18    31.0   NaN        S   18.0000
19     NaN   NaN        C    7.2250
20    35.0   NaN        S   26.0000
22    15.0   NaN        Q    8.0292
24     8.0   NaN        S   21.0750
25    38.0   NaN        S   31.3875
26     NaN   NaN        C    7.2250
28     NaN   NaN        Q    7.8792
29     NaN   NaN        S    7.8958
30    40.0   NaN        C   27.7208
31     NaN   B78        C  146.5208
32     NaN   NaN        Q    7.7500
33    66.0   NaN        S   10.5000
34    28.0   NaN        C   82.1708
35    42.0   NaN        S   52.0000
36     NaN   NaN        C    7.2292
37    21.0   NaN        S    8.0500
...    ...   ...      ...       ...
1279  21.0   NaN        Q    7.7500
1280   6.0   NaN        S   21.0750
1281  23.0   B24        S   93.5000
1282  51.0   D28        S   39.4000
1283  13.0   NaN        S   20.2500
1284  47.0   NaN        S   10.5000
1285  29.0   NaN        S   22.0250
1286  18.0   C31        S   60.0000
1287  24.0   NaN        Q    7.2500
1288  48.0   B41        C   79.2000
1289  22.0   NaN        S    7.7750
1290  31.0   NaN        Q    7.7333
1291  30.0    C7        S  164.8667
1292  38.0   NaN        S   21.0000
1293  22.0   NaN        C   59.4000
1294  17.0   NaN        S   47.1000
1295  43.0   D40        C   27.7208
1296  20.0   D38        C   13.8625
1297  23.0   NaN        S   10.5000
1298  50.0   C80        C  211.5000
1299   NaN   NaN        Q    7.7208
1300   3.0   NaN        S   13.7750
1301   NaN   NaN        Q    7.7500
1302  37.0   C78        Q   90.0000
1303  28.0   NaN        S    7.7750
1304   NaN   NaN        S    8.0500
1305  39.0  C105        C  108.9000
1306  38.5   NaN        S    7.2500
1307   NaN   NaN        S    8.0500
1308   NaN   NaN        C   22.3583

                                                   Name  Parch  PassengerId  \
0                               Braund, Mr. Owen Harris      0            1
2                                Heikkinen, Miss. Laina      0            3
4                              Allen, Mr. William Henry      0            5
5                                      Moran, Mr. James      0            6
7                        Palsson, Master. Gosta Leonard      1            8
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      2            9
9                   Nasser, Mrs. Nicholas (Adele Achem)      0           10
12                       Saundercock, Mr. William Henry      0           13
13                          Andersson, Mr. Anders Johan      5           14
14                 Vestrom, Miss. Hulda Amanda Adolfina      0           15
15                     Hewlett, Mrs. (Mary D Kingcome)       0           16
16                                 Rice, Master. Eugene      1           17
17                         Williams, Mr. Charles Eugene      0           18
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...      0           19
19                              Masselmani, Mrs. Fatima      0           20
20                                 Fynney, Mr. Joseph J      0           21
22                          McGowan, Miss. Anna "Annie"      0           23
24                        Palsson, Miss. Torborg Danira      1           25
25    Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...      5           26
26                              Emir, Mr. Farred Chehab      0           27
28                        O'Dwyer, Miss. Ellen "Nellie"      0           29
29                                  Todoroff, Mr. Lalio      0           30
30                             Uruchurtu, Don. Manuel E      0           31
31       Spencer, Mrs. William Augustus (Marie Eugenie)      0           32
32                             Glynn, Miss. Mary Agatha      0           33
33                                Wheadon, Mr. Edward H      0           34
34                              Meyer, Mr. Edgar Joseph      0           35
35                       Holverson, Mr. Alexander Oskar      0           36
36                                     Mamee, Mr. Hanna      0           37
37                             Cann, Mr. Ernest Charles      0           38
...                                                 ...    ...          ...
1279                               Canavan, Mr. Patrick      0         1280
1280                        Palsson, Master. Paul Folke      1         1281
1281                         Payne, Mr. Vivian Ponsonby      0         1282
1282     Lines, Mrs. Ernest H (Elizabeth Lindsey James)      1         1283
1283                      Abbott, Master. Eugene Joseph      2         1284
1284                               Gilbert, Mr. William      0         1285
1285                           Kink-Heilmann, Mr. Anton      1         1286
1286     Smith, Mrs. Lucien Philip (Mary Eloise Hughes)      0         1287
1287                               Colbert, Mr. Patrick      0         1288
1288  Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...      1         1289
1289                     Larsson-Rondberg, Mr. Edvard A      0         1290
1290                           Conlon, Mr. Thomas Henry      0         1291
1291                            Bonnell, Miss. Caroline      0         1292
1292                                    Gale, Mr. Harry      0         1293
1293                     Gibson, Miss. Dorothy Winifred      1         1294
1294                             Carrau, Mr. Jose Pedro      0         1295
1295                       Frauenthal, Mr. Isaac Gerald      0         1296
1296       Nourney, Mr. Alfred (Baron von Drachstedt")"      0         1297
1297                          Ware, Mr. William Jeffery      0         1298
1298                         Widener, Mr. George Dunton      1         1299
1299                    Riordan, Miss. Johanna Hannah""      0         1300
1300                          Peacock, Miss. Treasteall      1         1301
1301                             Naughton, Miss. Hannah      0         1302
1302    Minahan, Mrs. William Edward (Lillian E Thorpe)      0         1303
1303                     Henriksson, Miss. Jenny Lovisa      0         1304
1304                                 Spector, Mr. Woolf      0         1305
1305                       Oliva y Ocana, Dona. Fermina      0         1306
1306                       Saether, Mr. Simon Sivertsen      0         1307
1307                                Ware, Mr. Frederick      0         1308
1308                           Peter, Master. Michael J      1         1309

      Pclass     Sex  SibSp  Survived              Ticket
0          3    male      1       0.0           A/5 21171
2          3  female      0       1.0    STON/O2. 3101282
4          3    male      0       0.0              373450
5          3    male      0       0.0              330877
7          3    male      3       0.0              349909
8          3  female      0       1.0              347742
9          2  female      1       1.0              237736
12         3    male      0       0.0           A/5. 2151
13         3    male      1       0.0              347082
14         3  female      0       0.0              350406
15         2  female      0       1.0              248706
16         3    male      4       0.0              382652
17         2    male      0       1.0              244373
18         3  female      1       0.0              345763
19         3  female      0       1.0                2649
20         2    male      0       0.0              239865
22         3  female      0       1.0              330923
24         3  female      3       0.0              349909
25         3  female      1       1.0              347077
26         3    male      0       0.0                2631
28         3  female      0       1.0              330959
29         3    male      0       0.0              349216
30         1    male      0       0.0            PC 17601
31         1  female      1       1.0            PC 17569
32         3  female      0       1.0              335677
33         2    male      0       0.0          C.A. 24579
34         1    male      1       0.0            PC 17604
35         1    male      1       0.0              113789
36         3    male      0       1.0                2677
37         3    male      0       0.0          A./5. 2152
...      ...     ...    ...       ...                 ...
1279       3    male      0       NaN              364858
1280       3    male      3       NaN              349909
1281       1    male      0       NaN               12749
1282       1  female      0       NaN            PC 17592
1283       3    male      0       NaN           C.A. 2673
1284       2    male      0       NaN          C.A. 30769
1285       3    male      3       NaN              315153
1286       1  female      1       NaN               13695
1287       3    male      0       NaN              371109
1288       1  female      1       NaN               13567
1289       3    male      0       NaN              347065
1290       3    male      0       NaN               21332
1291       1  female      0       NaN               36928
1292       2    male      1       NaN               28664
1293       1  female      0       NaN              112378
1294       1    male      0       NaN              113059
1295       1    male      1       NaN               17765
1296       2    male      0       NaN       SC/PARIS 2166
1297       2    male      1       NaN               28666
1298       1    male      1       NaN              113503
1299       3  female      0       NaN              334915
1300       3  female      1       NaN  SOTON/O.Q. 3101315
1301       3  female      0       NaN              365237
1302       1  female      1       NaN               19928
1303       3  female      0       NaN              347086
1304       3    male      0       NaN           A.5. 3236
1305       1  female      0       NaN            PC 17758
1306       3    male      0       NaN  SOTON/O.Q. 3101262
1307       3    male      0       NaN              359309
1308       3    male      1       NaN                2668

[1126 rows x 12 columns]

In [23]:
titanic.drop('PassengerId',axis=1,inplace=True)

In [24]:
# to verify that PassengerId is gone, sorry old habit :)
titanic.keys()

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'Pclass', 'Sex',
       'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [25]:
#creating title for feature engineering

titanic['Title']=titanic.Name.apply(lambda name:name.split(',')[1].split('.')[0].strip())

titanic.head()

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket,Title
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0.0,A/5 21171,Mr
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1.0,PC 17599,Mrs
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1.0,STON/O2. 3101282,Miss
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1.0,113803,Mrs
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0.0,373450,Mr

In [27]:
print(titanic.Title.unique())

['Mr' 'Mrs' 'Miss' 'Master' 'Don' 'Rev' 'Dr' 'Mme' 'Ms' 'Major' 'Lady'
 'Sir' 'Mlle' 'Col' 'Capt' 'the Countess' 'Jonkheer' 'Dona']

In [28]:
# normalize the titles
normalized_titles = {
    "Capt":       "Officer",
    "Col":        "Officer",
    "Major":      "Officer",
    "Jonkheer":   "Royalty",
    "Don":        "Royalty",
    "Sir" :       "Royalty",
    "Dr":         "Officer",
    "Rev":        "Officer",
    "the Countess":"Royalty",
    "Dona":       "Royalty",
    "Mme":        "Mrs",
    "Mlle":       "Miss",
    "Ms":         "Mrs",
    "Mr" :        "Mr",
    "Mrs" :       "Mrs",
    "Miss" :      "Miss",
    "Master" :    "Master",
    "Lady" :      "Royalty"
}